## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/87c59ea6-36c0-4161-9a3b-371f5c455a3d).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.atlas_schema.terrateam will be read during apply
  # (config refers to values not yet known)
 <= data "atlas_schema" "terrateam" {
+       dev_db_url = (sensitive value)
+       hcl        = (known after apply)
+       id         = (known after apply)
+       src        = <<-EOT
            # CREATE TABLE users (
            #     id UUID PRIMARY KEY,
            #     created_at TIMESTAMP NOT NULL,
            #     updated_at TIMESTAMP NOT NULL,
            #     name TEXT NOT NULL
            # );
            
            schema "terrateam" {}
            
            table "users" {
              constraint "users" {
                primary_key = true
                columns     = ["id"]
                type        = "uuid"
              }
              constraint "created_at" {
                columns     = ["created_at"]
                type        = "timestamp"
                not_null    = true
              }
              constraint "updated_at" {
                columns     = ["updated_at"]
                type        = "timestamp"
                not_null    = true
              }
              constraint "name" {
                columns     = ["name"]
                type        = "text"
                not_null    = true
              }
            }
        EOT
    }

  # atlas_schema.terrateam will be created
+   resource "atlas_schema" "terrateam" {
+       hcl = (known after apply)
+       id  = (known after apply)
+       url = (sensitive value)
    }

  # aws_db_instance.terrateam will be created
+   resource "aws_db_instance" "terrateam" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_insights_mode                = (known after apply)
+       db_name                               = (known after apply)
+       db_subnet_group_name                  = "terrateam"
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "5.7"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "terrateam"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       password_wo                           = (write-only attribute)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = "gp2"
+       tags_all                              = (known after apply)
+       timezone                              = (known after apply)
+       username                              = (sensitive value)
+       vpc_security_group_ids                = (known after apply)
    }

  # aws_security_group.rds will be created
+   resource "aws_security_group" "rds" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "terrateam"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = "vpc-08a34afc4a7a1512c"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 14.41 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 14.41 | 14.41|
| | **Total** | **0.00** | **14.41** | **14.41** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
